package DataPackage;

//temporary data class : for test
public class TestData {
	String table_data[][] = {
			{"가나", "열대성", "기독교"}, //0
			{"그리스", "지중해성", "그리스 정교"}, //1
			{"모나코", "지중해성", "가톨릭"}, //2
			{"볼리비아", "열대성", "가톨릭"}, //3
			{"세르비아", "대륙성기후", "세르비아정교"}, //4
			{"스페인", "온대성", "가톨릭"}, //5
			{"아르헨티나", "아열대성", "가톨릭"}, //6
			{"알바니아", "지중해성 기후", "이슬람교"}, //7
			{"요르단", "반건조성", "이슬람교"}, //8
			{"조지아", "아열대성", "조지아정교"}, //9
			{"캐나다", "한랭", "가톨릭,개신교"}, //10
			{"타이완", "아열대성", "불교,기독교"}, //11
			{"투르크메니스탄", "대륙성사막기후", "이슬람교"}, //12
			{"필리핀", "고온다습", "천주교"}, //13
			{"홍콩", "아열대성", ""} //14
	};
	
	//condition's index in table_index_data
	//we use binary search in condition search between index
	String table_index_condition[][] = {
			{"기후", "0"},
			{"종교", "9"}
	};
	
	//record data's index, according to the conditions.
	String table_index_data[][] = {
			{"고온다습", "13"}, //0
			{"대륙성", "4"}, //1
			{"대륙성 사막", "12"}, //2
			{"반건조성", "8"}, //3
			{"아열대성", "6,9,11,14"}, //4
			{"열대성", "0,3"}, //5
			{"온대성", "5"}, //6
			{"지중해성", "1,2,7"}, //7
			{"한랭", "10"}, //8
			
			{"가톨릭", "2,3,5,6,10"},
			{"개신교", "10"},
			{"그리스정교", "1"},
			{"기독교", "0,11"},
			{"불교", "11"},
			{"세르비아정교", "4"},
			{"이슬람교", "7,8,12"},
			{"조지아정교", "9"},
			{"천주교", "13"}
	};
	
	//record consonant's index
	String table_index_cons[][] = {
			{"ㄱ", "0"},
			{"ㅁ", "2"},
			{"ㅂ", "3"},
			{"ㅅ", "4"},
			{"ㅇ", "6"},
			{"ㅈ", "9"},
			{"ㅋ", "10"},
			{"ㅌ", "11"},
			{"ㅍ", "13"},
			{"ㅎ", "14"}
	};
	
	String[] consonant = {
			"ㄱ","ㄲ","ㄴ","ㄷ","ㄸ","ㄹ","ㅁ","ㅂ","ㅃ", 
			"ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"
	};
}
